I've tested the PR locally and it is still trying to delete/recreate the secondary when  `create_mode = "Secondary"` is set.

If `create_mode = "Secondary"` is not set, it still fails with:

```
Error: failure in issuing create/update request for SQL Database "test-db" Blob Auditing Policies(SQL Server "test-mssql-db-secondary"/ Resource Group "test-mssql-db-rg"): sql.ExtendedDatabaseBlobAuditingPoliciesClient#CreateOrUpdate: Failure responding to request: StatusCode=400 -- Original Error: autorest/azure: Service returned an error. Status=400 Code="BlobAuditingIsNotSupportedOnGeoDr" Message="Blob auditing can be configured on primary databases only."
```

Here is the output from `terraform plan` when `create_mode = "Secondary"` is included.

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_mssql_database.secondary_db must be replaced
-/+ resource "azurerm_mssql_database" "secondary_db" {
        auto_pause_delay_in_minutes = 0
        collation                   = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                 = "Secondary" # forces replacement
      + creation_source_database_id = (known after apply)
        extended_auditing_policy    = []
      ~ id                          = "/subscriptions/899bf076-632b-4143-b015-43da8179e53f/resourceGroups/test-mssql-db-rg/providers/Microsoft.Sql/servers/test-mssql-db-secondary/databases/test-db" -> (known after apply)
        license_type                = "LicenseIncluded"
        max_size_gb                 = 10
        min_capacity                = 0
        name                        = "test-db"
        read_replica_count          = 0
        read_scale                  = false
      + restore_point_in_time       = (known after apply)
      + sample_name                 = (known after apply)
        server_id                   = "/subscriptions/899bf076-632b-4143-b015-43da8179e53f/resourceGroups/test-mssql-db-rg/providers/Microsoft.Sql/servers/test-mssql-db-secondary"
        sku_name                    = "GP_Gen5_2"
        storage_account_type        = "GRS"
        tags                        = {
            "creator" = "eb"
        }
        zone_redundant              = false

      ~ long_term_retention_policy {
          ~ monthly_retention = "PT0S" -> (known after apply)
          ~ week_of_year      = 0 -> (known after apply)
          ~ weekly_retention  = "PT0S" -> (known after apply)
          ~ yearly_retention  = "PT0S" -> (known after apply)
        }

        short_term_retention_policy {
            retention_days = 7
        }

      ~ threat_detection_policy {
          - disabled_alerts      = [] -> null
            email_account_admins = "Disabled"
          - email_addresses      = [] -> null
            retention_days       = 0
            state                = "Disabled"
          + use_server_default   = "Disabled"
        }

        timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
``` 